Revit 2024 API
ExportPatternTable Methods
The ExportPatternTable type exposes the following members.
Methods
Name | Description
Add
 Inserts a (key,info) pair into Export pattern table.
Clear
 Removes all contents stored in the table.
ContainsKey
 Checks whether a pattern key exists in the table.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetExportPatternInfo
 Gets a copy of the pattern info associated to the input pattern key.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetKeys
 Gets all the keys stored in the map.
GetPatternTableIterator
Returns a PatternTableIterator that iterates through the collection.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetValues
 Returns all the values stored in the map.
Remove
 Removes the pair (key, info) by pattern key.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ExportPatternTable Class
Autodesk.Revit.DB Namespace